In [1]:
import pandas as pd
pd.Series([7,3,5,8])

0    7
1    3
2    5
3    8
dtype: int64

In [16]:
x = pd.Series([7,3,5,8], index = ['서울', '대구', '부산', '광주'])
x['서울']

7

In [4]:
x[0]

7

In [5]:
x[['서울','대구']]

서울    7
대구    3
dtype: int64

In [17]:
x.index

Index(['서울', '대구', '부산', '광주'], dtype='object')

In [18]:
print(sorted(x.index))

['광주', '대구', '부산', '서울']

In [19]:
x = x.reindex(sorted(x.index))
x

광주    8
대구    3
부산    5
서울    7
dtype: int64

In [8]:
type(x)

pandas.core.series.Series

In [21]:
x = pd.Series([3,8,5,9], index = ['서울', '대구', '부산', '광주'])
y = pd.Series([2,4,5,1], index = ['대구', '부산', '서울', '대전'])
x+y

광주     NaN
대구    10.0
대전     NaN
부산     9.0
서울     8.0
dtype: float64

In [24]:
medal = [1,3,2,4,2,3]
x = pd.Series(medal)
print(pd.unique(x))

[1 3 2 4]

In [26]:
data = {'age' : [23,43,12,45],
       'name' : ['민준', '현우', '서연', '동현'],
        'height' : [175.3, 180.3, 165.8, 172.7]}
x= pd.DataFrame(data, columns = ['name', 'height', 'age'])
x

  name  height  age
0   민준   175.3   23
1   현우   180.3   43
2   서연   165.8   12
3   동현   172.7   45

In [68]:
x.mean(axis = 0)

height    173.525
age        30.750
dtype: float64

In [59]:
ary = [[1,2], [3,4], [5,6],[7,8],[9,10]]
data = pd.DataFrame(ary, columns = ['First', 'Second'])
data

   First  Second
0      1       2
1      3       4
2      5       6
3      7       8
4      9      10

In [60]:
data.iloc[:,1]

0     2
1     4
2     6
3     8
4    10
Name: Second, dtype: int64

In [61]:
data.loc[:,'Second']

0     2
1     4
2     6
3     8
4    10
Name: Second, dtype: int64

In [62]:
data.head()

   First  Second
0      1       2
1      3       4
2      5       6
3      7       8
4      9      10

In [64]:
data.tail(2)

   First  Second
3      7       8
4      9      10

In [70]:
bools = [False, True, True, False, True]
data[bools]

   First  Second
1      3       4
2      5       6
4      9      10

In [96]:
data = {'age' : [64,58,24,22,20],
       'name' : ['세헌', '혜영', '현민', '주희', '소영'],
        'height' : [172.0, 161.4, 155.5, 161.0, 159.5]}
x= pd.DataFrame(data, columns = ['name', 'height', 'age'])

  name  height  age
0   세헌   172.0   64
1   혜영   161.4   58
2   현민   155.5   24
3   주희   161.0   22
4   소영   159.5   20

In [103]:
x

  name  height  age
0   세헌   172.0   64
1   혜영   161.4   58
2   현민   155.5   24
3   주희   161.0   22
4   소영   159.5   20

In [104]:
x.iloc[:,1]

0    172.0
1    161.4
2    155.5
3    161.0
4    159.5
Name: height, dtype: float64

In [98]:
x.iloc[0,:]

name       세헌
height    172
age        64
Name: 0, dtype: object

In [102]:
x.iloc[2,1]

155.5

In [100]:
x.mean(axis = 0)

height    161.88
age        37.60
dtype: float64